# oop   객체 지향 프로그래밍
# 
# 객체라는 독립된 작은 단위들의 모임 

# 객체  vs 클래스 차이?

#  객체(object)
#  속성(attribute)     저글링 체력 크기 등등
#  기능(function)       달리기  공격

# 객체를 지향하나 객체끼리는 유기적으로 결합

# 클래스(clase) ->   붕어빵 틀

# 객체를 만들기 위한 설계도 

#  클래스를 통해 객체를 만들면  -> 실체화 : instance

# 그 각각의 객체들은 독립적이며 동일하지 않음 (저글링도 위치 체력 등등 모두 독립적인거랑 똑같음)

# 클래스 구조

# 키워드 이름 콜론

# class FishBread:       -> 선언부 
#     def __int__(self, f, b):   - >  속성부 
#         self.flour = f
#         self.flour = b       변수지만  class에선 속성이라고 불림 

#     def a,ke

